#    -*- mode: org -*-

** DONE [#A] 资源类型学习                                             :learn:
   CLOSED: [2021-04-17 周六 17:30] SCHEDULED: <2021-04-17 周六 13:00>
   :PROPERTIES:
   :ARCHIVE_TIME: 2021-04-17 周六 23:41
   :END:
- State "DONE"       from "TODO"       [2021-04-17 周六 17:30]
:LOGBOOK:
CLOCK: [2021-04-17 周六 17:12]--[2021-04-17 周六 17:30] =>  0:18
CLOCK: [2021-04-17 周六 16:42]--[2021-04-17 周六 17:07] =>  0:25
CLOCK: [2021-04-17 周六 16:12]--[2021-04-17 周六 16:37] =>  0:25
CLOCK: [2021-04-17 周六 15:42]--[2021-04-17 周六 16:07] =>  0:25
CLOCK: [2021-04-17 周六 14:37]--[2021-04-17 周六 15:02] =>  0:25
CLOCK: [2021-04-17 周六 14:07]--[2021-04-17 周六 14:32] =>  0:25
CLOCK: [2021-04-17 周六 13:17]--[2021-04-17 周六 13:42] =>  0:25
:END:
** DONE [#A] 在线更新                                                 :learn:
   CLOSED: [2021-04-25 周日 19:21] SCHEDULED: <2021-04-25 周日 19:10>
   :PROPERTIES:
   :ARCHIVE_TIME: 2021-04-25 周日 21:59
   :END:
- State "DONE"       from "TODO"       [2021-04-25 周日 19:21]
:LOGBOOK:
CLOCK: [2021-04-25 周日 19:11]--[2021-04-25 周日 19:21] =>  0:10
:END:
** DONE [#A] Cocos2d摄像机渲染顺序                                    :learn:
   CLOSED: [2021-04-25 周日 20:21] SCHEDULED: <2021-04-25 周日 19:25>
   :PROPERTIES:
   :ARCHIVE_TIME: 2021-04-25 周日 21:59
   :END:
- State "DONE"       from "TODO"       [2021-04-25 周日 20:21]
:LOGBOOK:
CLOCK: [2021-04-25 周日 19:55]--[2021-04-25 周日 20:20] =>  0:25
CLOCK: [2021-04-25 周日 19:25]--[2021-04-25 周日 19:50] =>  0:25
:END:
** DONE [#A] M8导表工具学习                                           :learn:
   CLOSED: [2021-04-29 周四 10:03] SCHEDULED: <2021-04-29 周四 9:50>
   :PROPERTIES:
   :ARCHIVE_TIME: 2021-04-30 周五 22:57
   :END:
- State "DONE"       from "TODO"       [2021-04-29 周四 10:03]
:LOGBOOK:
CLOCK: [2021-04-29 周四 09:47]--[2021-04-29 周四 10:03] =>  0:16
:END:
** DONE [#A] 学习PMGO系统                                             :learn:
   CLOSED: [2021-04-26 周一 10:42] SCHEDULED: <2021-04-26 周一 09:00>
   :PROPERTIES:
   :ARCHIVE_TIME: 2021-04-30 周五 22:57
   :END:
- State "DONE"       from "TODO"       [2021-04-26 周一 10:42]
:LOGBOOK:
CLOCK: [2021-04-26 周一 10:32]--[2021-04-26 周一 10:42] =>  0:10
:END:

*** DONE 学习12-14章
    CLOSED: [2021-03-31 周三 21:05] DEADLINE: <2021-03-31 周三 21:20>
:LOGBOOK:
CLOCK: [2021-03-31 周三 14:21]--[2021-03-31 周三 14:46] =>  0:25
CLOCK: [2021-03-31 周三 13:55]--[2021-03-31 周三 14:15] =>  0:20
CLOCK: [2021-03-31 周三 12:58]--[2021-03-31 周三 13:24] =>  0:26
CLOCK: [2021-03-31 周三 10:19]--[2021-03-31 周三 11:37] =>  1:18
:END:

*** DONE OOP要点
    CLOSED: [2021-04-14 周三 17:25] SCHEDULED: <2021-04-14 周三 10:30>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :ATTACH:   [[attachment:~/myproject/src/org/note/tech_note.org::*UML图][UML]]
    :END:
:LOGBOOK:
CLOCK: [2021-04-14 周三 16:44]--[2021-04-14 周三 17:09] =>  0:25
CLOCK: [2021-04-14 周三 16:14]--[2021-04-14 周三 16:39] =>  0:25
CLOCK: [2021-04-14 周三 15:39]--[2021-04-14 周三 16:04] =>  0:25
CLOCK: [2021-04-14 周三 13:03]--[2021-04-14 周三 13:23] =>  0:20
:END:
- State "DONE"       from "TODO"       [2021-04-14 周三 17:25] \\
  1. 组合大于继承
  2. 可读大于精简
  3. 注释诠释用法
  4. 命名表明含义
  5. 合理控制深度
*** DONE 网络交互
    CLOSED: [2021-04-14 周三 22:57] SCHEDULED: <2021-04-14 周三 17:25>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-14 周三 22:57]
:LOGBOOK:
CLOCK: [2021-04-14 周三 19:39]--[2021-04-14 周三 20:04] =>  0:25
CLOCK: [2021-04-14 周三 19:04]--[2021-04-14 周三 19:29] =>  0:25
:END:
*** DONE 观察者+信号
    CLOSED: [2021-04-15 周四 15:20] SCHEDULED: <2021-04-15 周四 09:50>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-15 周四 15:20]
:LOGBOOK:
CLOCK: [2021-04-15 周四 14:50]--[2021-04-15 周四 15:15] =>  0:25
:END:
*** DONE MVC框架
    CLOSED: [2021-04-16 周五 16:28] SCHEDULED: <2021-04-15 周四 15:20>
    :PROPERTIES:
    :TRIGGER+: parent todo!(DONE)
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
:LOGBOOK:
CLOCK: [2021-04-16 周五 16:13]--[2021-04-16 周五 16:28] =>  0:15
CLOCK: [2021-04-16 周五 15:38]--[2021-04-16 周五 16:03] =>  0:25
CLOCK: [2021-04-16 周五 15:08]--[2021-04-16 周五 15:33] =>  0:25
CLOCK: [2021-04-16 周五 14:38]--[2021-04-16 周五 15:03] =>  0:25
CLOCK: [2021-04-16 周五 14:08]--[2021-04-16 周五 14:33] =>  0:25
CLOCK: [2021-04-16 周五 13:33]--[2021-04-16 周五 13:58] =>  0:25
CLOCK: [2021-04-16 周五 10:53]--[2021-04-16 周五 11:18] =>  0:25
CLOCK: [2021-04-16 周五 10:23]--[2021-04-16 周五 10:48] =>  0:25
CLOCK: [2021-04-16 周五 09:53]--[2021-04-16 周五 10:18] =>  0:25
CLOCK: [2021-04-15 周四 20:35]--[2021-04-15 周四 21:00] =>  0:25
CLOCK: [2021-04-15 周四 20:05]--[2021-04-15 周四 20:30] =>  0:25
CLOCK: [2021-04-15 周四 19:35]--[2021-04-15 周四 20:00] =>  0:25
CLOCK: [2021-04-15 周四 17:12]--[2021-04-15 周四 17:37] =>  0:25
CLOCK: [2021-04-15 周四 16:22]--[2021-04-15 周四 16:47] =>  0:25
CLOCK: [2021-04-15 周四 15:52]--[2021-04-15 周四 16:17] =>  0:25
CLOCK: [2021-04-15 周四 15:20]--[2021-04-15 周四 15:45] =>  0:25
:END:

*** DONE 阅读代码规范                                                :ATTACH:
    CLOSED: [2021-04-19 周一 15:01] SCHEDULED: <2021-04-19 周一 11:30>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :ID:       8d2f5874-274c-469c-94b2-b7deec102799
    :ATTACH:   [[attachment:liwei_engine.org::*代码规范][代码规范]]
    :END:
- State "DONE"       from "TODO"       [2021-04-19 周一 15:01]
:LOGBOOK:
CLOCK: [2021-04-19 周一 13:40]--[2021-04-19 周一 14:05] =>  0:25
CLOCK: [2021-04-19 周一 13:10]--[2021-04-19 周一 13:35] =>  0:25
:END:
*** DONE 搭建环境
    CLOSED: [2021-04-19 周一 15:40] SCHEDULED: <2021-04-19 周一 15:01>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-19 周一 15:40]
:LOGBOOK:
CLOCK: [2021-04-19 周一 15:02]--[2021-04-19 周一 15:27] =>  0:25
:END:
*** DONE 阅读源码分析结构
    CLOSED: [2021-04-19 周一 15:58] SCHEDULED: <2021-04-19 周一 15:40>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-19 周一 15:58]
:LOGBOOK:
CLOCK: [2021-04-19 周一 15:30]--[2021-04-19 周一 15:55] =>  0:25
:END:
*** DONE 设计数据导表
    CLOSED: [2021-04-19 周一 17:15] SCHEDULED: <2021-04-19 周一 15:58>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-19 周一 17:15]
:LOGBOOK:
CLOCK: [2021-04-19 周一 17:01]--[2021-04-19 周一 17:15] =>  0:14
CLOCK: [2021-04-19 周一 16:31]--[2021-04-19 周一 16:56] =>  0:25
CLOCK: [2021-04-19 周一 16:01]--[2021-04-19 周一 16:26] =>  0:25
:END:
*** DONE 设计界面
    CLOSED: [2021-04-19 周一 22:01] SCHEDULED: <2021-04-19 周一 17:15>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-19 周一 22:01]
- Note taken on [2021-04-19 周一 20:47] \\
  按钮路径 Res/g3/newg3/hengfenye1.plist
:LOGBOOK:
CLOCK: [2021-04-19 周一 20:43]--[2021-04-19 周一 21:08] =>  0:25
CLOCK: [2021-04-19 周一 20:13]--[2021-04-19 周一 20:38] =>  0:25
CLOCK: [2021-04-19 周一 19:43]--[2021-04-19 周一 20:08] =>  0:25
CLOCK: [2021-04-19 周一 19:13]--[2021-04-19 周一 19:38] =>  0:25
:END:
*** DONE 完成类设计
    CLOSED: [2021-04-20 周二 16:43] SCHEDULED: <2021-04-20 周二 10:00>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-20 周二 16:43]
:LOGBOOK:
CLOCK: [2021-04-20 周二 15:49]--[2021-04-20 周二 16:14] =>  0:25
CLOCK: [2021-04-20 周二 15:19]--[2021-04-20 周二 15:44] =>  0:25
CLOCK: [2021-04-20 周二 14:49]--[2021-04-20 周二 15:14] =>  0:25
CLOCK: [2021-04-20 周二 14:14]--[2021-04-20 周二 14:39] =>  0:25
CLOCK: [2021-04-20 周二 13:44]--[2021-04-20 周二 14:09] =>  0:25
CLOCK: [2021-04-20 周二 13:14]--[2021-04-20 周二 13:39] =>  0:25
CLOCK: [2021-04-20 周二 11:12]--[2021-04-20 周二 11:37] =>  0:25
CLOCK: [2021-04-20 周二 10:42]--[2021-04-20 周二 11:07] =>  0:25
CLOCK: [2021-04-20 周二 10:12]--[2021-04-20 周二 10:37] =>  0:25
:END:
*** DONE 设计交互协议
    CLOSED: [2021-04-20 周二 20:36] SCHEDULED: <2021-04-20 周二 16:43>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-20 周二 20:36]
:LOGBOOK:
CLOCK: [2021-04-20 周二 20:09]--[2021-04-20 周二 20:34] =>  0:25
CLOCK: [2021-04-20 周二 19:39]--[2021-04-20 周二 20:04] =>  0:25
CLOCK: [2021-04-20 周二 19:09]--[2021-04-20 周二 19:34] =>  0:25
CLOCK: [2021-04-20 周二 17:25]--[2021-04-20 周二 17:50] =>  0:25
CLOCK: [2021-04-20 周二 16:50]--[2021-04-20 周二 17:15] =>  0:25
:END:
*** DONE 实现服务端类框架
    CLOSED: [2021-04-21 周三 16:55] SCHEDULED: <2021-04-21 周三 09:36>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-21 周三 16:55]
:LOGBOOK:
CLOCK: [2021-04-21 周三 16:28]--[2021-04-21 周三 16:53] =>  0:25
CLOCK: [2021-04-21 周三 15:58]--[2021-04-21 周三 16:23] =>  0:25
CLOCK: [2021-04-21 周三 13:18]--[2021-04-21 周三 13:43] =>  0:25
CLOCK: [2021-04-21 周三 11:13]--[2021-04-21 周三 11:38] =>  0:25
CLOCK: [2021-04-21 周三 10:43]--[2021-04-21 周三 11:08] =>  0:25
CLOCK: [2021-04-21 周三 10:13]--[2021-04-21 周三 10:38] =>  0:25
CLOCK: [2021-04-21 周三 09:43]--[2021-04-21 周三 10:08] =>  0:25
:END:
*** DONE 完成交互协议
    CLOSED: [2021-04-21 周三 22:16] SCHEDULED: <2021-04-21 周三 16:58>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-21 周三 22:16]
:LOGBOOK:
CLOCK: [2021-04-21 周三 21:43]--[2021-04-21 周三 22:08] =>  0:25
CLOCK: [2021-04-21 周三 21:13]--[2021-04-21 周三 21:38] =>  0:25
CLOCK: [2021-04-21 周三 20:13]--[2021-04-21 周三 20:38] =>  0:25
CLOCK: [2021-04-21 周三 19:38]--[2021-04-21 周三 20:03] =>  0:25
CLOCK: [2021-04-21 周三 16:58]--[2021-04-21 周三 17:23] =>  0:25
:END:
*** DONE 实现模型层
    CLOSED: [2021-04-22 周四 20:05] SCHEDULED: <2021-04-22 周四 09:16>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-22 周四 20:05]
:LOGBOOK:
CLOCK: [2021-04-22 周四 19:26]--[2021-04-22 周四 19:51] =>  0:25
CLOCK: [2021-04-22 周四 16:59]--[2021-04-22 周四 17:24] =>  0:25
CLOCK: [2021-04-22 周四 16:29]--[2021-04-22 周四 16:54] =>  0:25
CLOCK: [2021-04-22 周四 15:59]--[2021-04-22 周四 16:24] =>  0:25
CLOCK: [2021-04-22 周四 15:24]--[2021-04-22 周四 15:49] =>  0:25
CLOCK: [2021-04-22 周四 14:54]--[2021-04-22 周四 15:19] =>  0:25
CLOCK: [2021-04-22 周四 14:24]--[2021-04-22 周四 14:49] =>  0:25
CLOCK: [2021-04-22 周四 13:54]--[2021-04-22 周四 14:19] =>  0:25
CLOCK: [2021-04-22 周四 13:19]--[2021-04-22 周四 13:44] =>  0:25
CLOCK: [2021-04-22 周四 11:01]--[2021-04-22 周四 11:26] =>  0:25
CLOCK: [2021-04-22 周四 10:31]--[2021-04-22 周四 10:56] =>  0:25
CLOCK: [2021-04-22 周四 10:01]--[2021-04-22 周四 10:26] =>  0:25
:END:
*** DONE 实现视图层
    CLOSED: [2021-04-23 周五 23:13] SCHEDULED: <2021-04-23 周五 09:05>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-23 周五 23:13]
:LOGBOOK:
CLOCK: [2021-04-23 周五 17:12]--[2021-04-23 周五 17:37] =>  0:25
CLOCK: [2021-04-23 周五 16:42]--[2021-04-23 周五 17:07] =>  0:25
CLOCK: [2021-04-23 周五 16:07]--[2021-04-23 周五 16:32] =>  0:25
CLOCK: [2021-04-23 周五 15:37]--[2021-04-23 周五 16:02] =>  0:25
CLOCK: [2021-04-23 周五 15:07]--[2021-04-23 周五 15:32] =>  0:25
CLOCK: [2021-04-23 周五 14:37]--[2021-04-23 周五 15:02] =>  0:25
CLOCK: [2021-04-23 周五 14:02]--[2021-04-23 周五 14:27] =>  0:25
CLOCK: [2021-04-23 周五 13:32]--[2021-04-23 周五 13:57] =>  0:25
CLOCK: [2021-04-23 周五 13:02]--[2021-04-23 周五 13:27] =>  0:25
CLOCK: [2021-04-23 周五 10:51]--[2021-04-23 周五 11:16] =>  0:25
CLOCK: [2021-04-23 周五 10:21]--[2021-04-23 周五 10:46] =>  0:25
CLOCK: [2021-04-23 周五 09:51]--[2021-04-23 周五 10:16] =>  0:25
CLOCK: [2021-04-23 周五 09:21]--[2021-04-23 周五 09:46] =>  0:25
CLOCK: [2021-04-22 周四 20:35]--[2021-04-22 周四 21:00] =>  0:25
CLOCK: [2021-04-22 周四 20:05]--[2021-04-22 周四 20:30] =>  0:25
:END:
*** DONE 实现额外功能
    CLOSED: [2021-04-25 周日 16:06] SCHEDULED: <2021-04-25 周日 9:00>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-25 周日 16:06]
:LOGBOOK:
CLOCK: [2021-04-25 周日 15:39]--[2021-04-25 周日 16:05] =>  0:26
CLOCK: [2021-04-25 周日 15:09]--[2021-04-25 周日 15:34] =>  0:25
CLOCK: [2021-04-25 周日 14:39]--[2021-04-25 周日 15:04] =>  0:25
CLOCK: [2021-04-25 周日 14:04]--[2021-04-25 周日 14:29] =>  0:25
CLOCK: [2021-04-25 周日 13:34]--[2021-04-25 周日 13:59] =>  0:25
CLOCK: [2021-04-25 周日 13:04]--[2021-04-25 周日 13:29] =>  0:25
CLOCK: [2021-04-25 周日 11:22]--[2021-04-25 周日 11:47] =>  0:25
CLOCK: [2021-04-25 周日 10:47]--[2021-04-25 周日 11:12] =>  0:25
CLOCK: [2021-04-25 周日 10:17]--[2021-04-25 周日 10:42] =>  0:25
CLOCK: [2021-04-25 周日 09:47]--[2021-04-25 周日 10:12] =>  0:25
CLOCK: [2021-04-25 周日 09:17]--[2021-04-25 周日 09:42] =>  0:25
:END:
** DONE [#A] 学习调试工具                                             :learn:
   CLOSED: [2021-04-19 周一 11:24] SCHEDULED: <2021-04-19 周一 11:10> DEADLINE: <2021-04-19 周一 21:00>
   :PROPERTIES:
   :BLOCKER:  children
   :ARCHIVE_TIME: 2021-04-25 周日 21:59
   :END:
- State "DONE"       from "SCH"        [2021-04-19 周一 11:24]
:LOGBOOK:
CLOCK: [2021-04-19 周一 11:13]--[2021-04-19 周一 11:25] =>  0:12
:END:
*** DONE 文本链接功能
    CLOSED: [2021-04-16 周五 17:36] SCHEDULED: <2021-04-16 周五 17:10>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-16 周五 17:36]
:LOGBOOK:
CLOCK: [2021-04-16 周五 17:11]--[2021-04-16 周五 17:36] =>  0:25
:END:
*** DONE 导表工具
    CLOSED: [2021-04-17 周六 23:18] SCHEDULED: <2021-04-18 周日 17:36>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-17 周六 23:18]
:LOGBOOK:
CLOCK: [2021-04-17 周六 23:12]--[2021-04-17 周六 23:18] =>  0:06
CLOCK: [2021-04-17 周六 22:42]--[2021-04-17 周六 23:07] =>  0:25
CLOCK: [2021-04-17 周六 22:12]--[2021-04-17 周六 22:37] =>  0:25
:END:
*** DONE 常用工具 [2/2]
    CLOSED: [2021-04-19 周一 10:56] SCHEDULED: <2021-04-19 周一 10:00>
    :PROPERTIES:
    :TRIGGER+: parent todo!(DONE)
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
:LOGBOOK:
CLOCK: [2021-04-19 周一 10:30]--[2021-04-19 周一 10:55] =>  0:25
:END:
- [X] 循环引用和Functor
- [X] 引擎IO和文件IO
:LOGBOOK:
CLOCK: [2021-04-25 周日 17:05]--[2021-04-25 周日 17:30] =>  0:25
CLOCK: [2021-04-25 周日 16:35]--[2021-04-25 周日 17:00] =>  0:25
CLOCK: [2021-04-25 周日 16:10]--[2021-04-25 周日 16:35] =>  0:25
:END:
*** DONE 英雄山组队关卡章节表
    CLOSED: [2021-04-29 周四 11:14] SCHEDULED: <2021-04-29 周四 11:00>
    :PROPERTIES:                          
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:                          
- State "DONE"       from "DONE"       [2021-04-29 周四 11:14]
:LOGBOOK:
CLOCK: [2021-04-29 周四 11:03]--[2021-04-29 周四 11:14] =>  0:11
CLOCK: [2021-04-29 周四 10:33]--[2021-04-29 周四 10:58] =>  0:25
CLOCK: [2021-04-29 周四 10:03]--[2021-04-29 周四 10:28] =>  0:25
:END:
*** DONE 英雄山组队关卡表
    CLOSED: [2021-04-29 周四 14:52] SCHEDULED: <2021-04-29 周四 11:15>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-29 周四 14:52]
:LOGBOOK:
CLOCK: [2021-04-29 周四 14:40]--[2021-04-29 周四 14:52] =>  0:12
CLOCK: [2021-04-29 周四 14:10]--[2021-04-29 周四 14:35] =>  0:25
CLOCK: [2021-04-29 周四 13:35]--[2021-04-29 周四 14:00] =>  0:25
CLOCK: [2021-04-29 周四 13:05]--[2021-04-29 周四 13:30] =>  0:25
:END:
*** DONE 环境搭建 
    CLOSED: [2021-04-26 周一 12:03] SCHEDULED: <2021-04-26 周一 11:00>
    :PROPERTIES:                          
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:                          
- State "DONE"       from "TODO"       [2021-04-26 周一 12:03]
:LOGBOOK:
CLOCK: [2021-04-26 周一 11:08]--[2021-04-26 周一 11:33] =>  0:25
:END:
*** DONE 利为引擎
    CLOSED: [2021-04-26 周一 15:58] SCHEDULED: <2021-04-26 周一 12:03>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-26 周一 15:58]
:LOGBOOK:
CLOCK: [2021-04-26 周一 15:35]--[2021-04-26 周一 15:58] =>  0:23
CLOCK: [2021-04-26 周一 15:05]--[2021-04-26 周一 15:30] =>  0:25
CLOCK: [2021-04-26 周一 14:35]--[2021-04-26 周一 15:00] =>  0:25
CLOCK: [2021-04-26 周一 14:05]--[2021-04-26 周一 14:30] =>  0:25
:END:
*** DONE UI基础
    CLOSED: [2021-04-26 周一 16:48] SCHEDULED: <2021-04-26 周一 15:58>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-26 周一 16:48]
:LOGBOOK:
CLOCK: [2021-04-26 周一 16:17]--[2021-04-26 周一 16:42] =>  0:25
:END:
*** DONE 代码设计和MVC介绍
    CLOSED: [2021-04-26 周一 17:16] SCHEDULED: <2021-04-26 周一 16:48>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-26 周一 17:16]
:LOGBOOK:
CLOCK: [2021-04-26 周一 16:58]--[2021-04-26 周一 17:16] =>  0:18
:END:
*** DONE 大作业
    CLOSED: [2021-04-26 周一 17:33] SCHEDULED: <2021-04-26 周一 17:19>
    :PROPERTIES:
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:
- State "DONE"       from "TODO"       [2021-04-26 周一 17:33]
:LOGBOOK:
CLOCK: [2021-04-26 周一 17:21]--[2021-04-26 周一 17:33] =>  0:12
:END:
** DONE [#A] 解决导表编辑器生成bug                                 :m8:learn:
   CLOSED: [2021-05-09 周日 10:05]
   :PROPERTIES:
   :ARCHIVE_TIME: 2021-05-09 周日 10:16
   :END:
- State "DONE"       from "TODO"       [2021-05-09 周日 10:05]
Scheduled: <2021-05-08 周六 19:00>
:LOGBOOK:
CLOCK: [2021-05-08 周六 22:22]--[2021-05-08 周六 22:47] =>  0:25
CLOCK: [2021-05-08 周六 21:52]--[2021-05-08 周六 22:17] =>  0:25
CLOCK: [2021-05-08 周六 21:22]--[2021-05-08 周六 21:47] =>  0:25
CLOCK: [2021-05-08 周六 20:47]--[2021-05-08 周六 21:12] =>  0:25
CLOCK: [2021-05-08 周六 20:17]--[2021-05-08 周六 20:42] =>  0:25
CLOCK: [2021-05-08 周六 19:47]--[2021-05-08 周六 20:12] =>  0:25
CLOCK: [2021-05-08 周六 19:17]--[2021-05-08 周六 19:42] =>  0:25
CLOCK: [2021-05-08 周六 18:42]--[2021-05-08 周六 19:07] =>  0:25
CLOCK: [2021-05-08 周六 18:12]--[2021-05-08 周六 18:37] =>  0:25
CLOCK: [2021-05-08 周六 17:42]--[2021-05-08 周六 18:07] =>  0:25
CLOCK: [2021-05-08 周六 17:12]--[2021-05-08 周六 17:37] =>  0:25
:END:
** DONE [#A] 完善英雄山代码                                         :m8:work:
   CLOSED: [2021-05-08 周六 22:36] SCHEDULED: <2021-05-08 周六 09:40>
   :PROPERTIES:
   :ARCHIVE_TIME: 2021-05-09 周日 10:16
   :END:
- State "DONE"       from "TODO"       [2021-05-08 周六 22:36]
:LOGBOOK:
CLOCK: [2021-05-08 周六 23:27]--[2021-05-08 周六 23:52] =>  0:25
CLOCK: [2021-05-08 周六 22:52]--[2021-05-08 周六 23:17] =>  0:25
CLOCK: [2021-05-08 周六 11:03]--[2021-05-08 周六 11:28] =>  0:25
CLOCK: [2021-05-08 周六 10:33]--[2021-05-08 周六 10:58] =>  0:25
CLOCK: [2021-05-08 周六 10:03]--[2021-05-08 周六 10:28] =>  0:25
CLOCK: [2021-05-08 周六 09:33]--[2021-05-08 周六 09:58] =>  0:25
:END:
** DONE [#A] 客户端本地处理容错                                     :m8:work:
   CLOSED: [2021-05-10 周一 14:41] SCHEDULED: <2021-05-10 周一 09:30>
   :PROPERTIES:
   :ARCHIVE_TIME: 2021-05-16 周日 23:48
   :END:
- State "DONE"       from "TODO"       [2021-05-10 周一 14:41]
:LOGBOOK:
CLOCK: [2021-05-10 周一 14:09]--[2021-05-10 周一 14:34] =>  0:25
CLOCK: [2021-05-10 周一 13:39]--[2021-05-10 周一 14:04] =>  0:25
CLOCK: [2021-05-10 周一 13:09]--[2021-05-10 周一 13:34] =>  0:25
CLOCK: [2021-05-10 周一 11:10]--[2021-05-10 周一 11:35] =>  0:25
:END:
*** DONE 阅读设计文档并绘制初版界面
    CLOSED: [2021-05-26 周三 15:24] SCHEDULED: <2021-05-25 周二 13:13>
    :PROPERTIES:                          
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:                          
- State "DONE"       from "TODO"       [2021-05-26 周三 15:24]
:LOGBOOK:
CLOCK: [2021-05-25 周二 15:47]--[2021-05-25 周二 16:12] =>  0:25
CLOCK: [2021-05-25 周二 15:17]--[2021-05-25 周二 15:42] =>  0:25
CLOCK: [2021-05-25 周二 14:42]--[2021-05-25 周二 15:07] =>  0:25
CLOCK: [2021-05-25 周二 14:12]--[2021-05-25 周二 14:37] =>  0:25
CLOCK: [2021-05-25 周二 13:42]--[2021-05-25 周二 14:07] =>  0:25
CLOCK: [2021-05-25 周二 13:12]--[2021-05-25 周二 13:37] =>  0:25
:END:
** DONE 组装一台性价比高的台式机用于开发和娱乐                     :shopping:
   CLOSED: [2021-06-18 周五 09:29]
   :PROPERTIES:
   :ARCHIVE_TIME: 2021-06-20 周日 09:43
   :END:
- State "DONE"       from "TODO"       [2021-06-18 周五 09:29] \\
  1. 最终还是下定决心, 在618进行一个电脑的买, 显卡忒贵了, 只能二手先顶顶了
  2. 如果不是缺货, 一定要最后一天(618)在买, 切记, 每个都能便宜点
<2021-06-01 周二>--<2021-06-30 周三>
- State "WAIT"       from "TODO"       [2021-04-10 周六 14:03] \\
  1. 显卡太贵
  2. 没钱
#+CAPTION[零件表]:
#+NAME: PC_PRICES
| component   | brand    | model                | price | lowest | diff | date |
|-------------+----------+----------------------+-------+--------+------+------|
| motherboard | ASUS-ROG | STRIX B550-F GAMING  |  1384 |   1429 |  -45 | 6.18 |
| cpu         | AMD      | Ryzen9-5900X         |  3694 |   3649 |   45 | 6.18 |
| memory      | G.SKILL  | TridentZ-neo(16GB*2) |  1549 |   1349 |  200 | 6.18 |
| ssd(sys)    | SAMSUNG  | 980-Pro(256GB)       |   499 |    449 |   50 | 6.16 |
| ssd(app)    | SAMSUNG  | 980(1TB)             |   993 |    939 |   54 | 6.16 |
| hdd(data)   | TOSHIBA  | P300(1TB)            |   269 |    241 |   28 | 6.19 |
| gpu         | MSI      | RTX-1063(second-h)   |  1114 |   1039 |   75 | 6.18 |
| power       | ASUS-ROG | THOR-850             |  1689 |   1689 |    0 | 6.18 |
| case        | PHANTEKS | P500A                |   559 |    399 |  160 | 6.15 |
| Fan         | PHANTEKS | Halos(14*1, 12*3)    |   360 |    280 |   80 | 6.16 |
| watercool   | NZXT     | Kraken-Z73           |  1693 |   1679 |   14 | 6.15 |
| Monitor     | MSI      | MAG274QRF-QD         |  1949 |   1879 |   70 | 6.16 |
| keyboard    | DURGOD   | K320w(silver)        |   616 |    629 |  -13 | 6.16 |
| earphone    | KINGSTON | HyperX-Cloud-Flight  |   596 |    559 |   37 | 6.16 |
| mouse       | LOGITECH | PRO-WIRELESS         |   596 |    599 |   -3 | 6.16 |
|             |          |                      | 17560 |  16808 |  752 |      |
#+Tblfm: $6=$4-$5::@17$4=vsum(+@I..@-1)::@17$5=vsum(+@I..@-1)
可能还需要线缆收纳, 硅脂, 防静电手环等设备

*** DONE 阅读设计文档并绘制初版界面
    CLOSED: [2021-05-26 周三 15:24] SCHEDULED: <2021-05-25 周二 13:13>
    :PROPERTIES:                          
    :TRIGGER:  next-sibling todo!(TODO) scheduled!("++0h") chain!("TRIGGER")
    :END:                          
- State "DONE"       from "TODO"       [2021-05-26 周三 15:24]
:LOGBOOK:
CLOCK: [2021-05-25 周二 15:47]--[2021-05-25 周二 16:12] =>  0:25
CLOCK: [2021-05-25 周二 15:17]--[2021-05-25 周二 15:42] =>  0:25
CLOCK: [2021-05-25 周二 14:42]--[2021-05-25 周二 15:07] =>  0:25
CLOCK: [2021-05-25 周二 14:12]--[2021-05-25 周二 14:37] =>  0:25
CLOCK: [2021-05-25 周二 13:42]--[2021-05-25 周二 14:07] =>  0:25
CLOCK: [2021-05-25 周二 13:12]--[2021-05-25 周二 13:37] =>  0:25
:END:
